sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
/*
 * FreeRTOS V202112.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/******************************************************************************
 * NOTE 1:  This project provides two demo applications.  A simple blinky
 * style project, and a more comprehensive test and demo application.  The
 * mainCREATE_SIMPLE_BLINKY_DEMO_ONLY setting in main.c is used to select
 * between the two.  See the notes on using mainCREATE_SIMPLE_BLINKY_DEMO_ONLY
 * in main.c.  This file implements the simply blinky style version.
 *
 * NOTE 2:  This file only contains the source code that is specific to the
 * basic demo.  Generic functions, such FreeRTOS hook functions, and functions
 * required to configure the hardware are defined in main.c.
 ******************************************************************************
 *
 * main_blinky() creates one queue, and two tasks.  It then starts the
 * scheduler.
 *
 * The Queue Send Task:
 * The queue send task is implemented by the prvQueueSendTask() function in
 * this file.  prvQueueSendTask() sits in a loop that causes it to repeatedly
 * block for 200 milliseconds, before sending the value 100 to the queue that
 * was created within main_blinky().  Once the value is sent, the task loops
 * back around to block for another 200 milliseconds...and so on.
 *
 * The Queue Receive Task:
 * The queue receive task is implemented by the prvQueueReceiveTask() function
 * in this file.  prvQueueReceiveTask() sits in a loop where it repeatedly
 * blocks on attempts to read data from the queue that was created within
 * main_blinky().  When data is received, the task checks the value of the
 * data, and if the value equals the expected 100, toggles an LED.  The 'block
 * time' parameter passed to the queue receive function specifies that the
 * task should be held in the Blocked state indefinitely to wait for data to
 * be available on the queue.  The queue receive task will only leave the
 * Blocked state when the queue send task writes to the queue.  As the queue
 * send task writes to the queue every 200 milliseconds, the queue receive
 * task leaves the Blocked state every 200 milliseconds, and therefore toggles
 * the LED every 200 milliseconds.
 */

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* Standard demo includes. */
#include "partest.h"

/* TI includes. */
#include "driverlib.h"

/* CAN includes */
#include <msp430.h>
#include "mcp2515.h"

#include "mission.h"

/* Priorities at which the tasks are created. */
#define mainQUEUE_RECEIVE_TASK_PRIORITY		( tskIDLE_PRIORITY + 2 )
#define	mainQUEUE_SEND_TASK_PRIORITY		( tskIDLE_PRIORITY + 1 )

/* The rate at which data is sent to the queue.  The 200ms value is converted
to ticks using the portTICK_PERIOD_MS constant. */
#define mainQUEUE_SEND_FREQUENCY_MS			( pdMS_TO_TICKS( 500 ) )

/* The number of items the queue can hold.  This is 1 as the receive task
will remove items as they are added, meaning the send task should always find
the queue empty. */
#define mainQUEUE_LENGTH					( 16 )

/* The LED toggled by the Rx task. */
#define mainTASK_LED						( 0 )

/*-----------------------------------------------------------*/

typedef enum
{
    eTimer = 0,
    eCAN   = 1,
    eADC   = 2
}eMsgType;

struct AppMessage
{
    uint8_t  msgID;
    uint8_t  msgByte;
    void    *pvData;
};

/*
 * Called by main when mainCREATE_SIMPLE_BLINKY_DEMO_ONLY is set to 1 in
 * main.c.
 */
void main_blinky( void );

/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask( void *pvParameters );
static void prvQueueSendTask( void *pvParameters );

uint8_t ADC10_B_getConvertedChannel (uint16_t baseAddress);

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;

struct AppMessage ADCResult = {0};
struct AppMessage CANflag = {0};

uint32_t rid;
uint8_t mext;
uint8_t irq, buf[8]; //, buf2[16];
uint16_t ADCdata[16];
uint32_t ADCtime;


/*-----------------------------------------------------------*/

void main_blinky( void )
{
	/* Create the queue. */
    //xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( uint32_t ) );
    xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( struct AppMessage ) );

	if( xQueue != NULL )
	{
		/* Start the two tasks as described in the comments at the top of this
		file. */
		xTaskCreate( prvQueueReceiveTask,				/* The function that implements the task. */
					"Rx", 								/* The text name assigned to the task - for debug only as it is not used by the kernel. */
					configMINIMAL_STACK_SIZE, 			/* The size of the stack to allocate to the task. */
					NULL, 								/* The parameter passed to the task - not used in this case. */
					mainQUEUE_RECEIVE_TASK_PRIORITY, 	/* The priority assigned to the task. */
					NULL );								/* The task handle is not required, so NULL is passed. */

		xTaskCreate( prvQueueSendTask, "TX", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_SEND_TASK_PRIORITY, NULL );

		/* Start the tasks and timer running. */
		vTaskStartScheduler();
	}

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created.  See the memory management section on the
	FreeRTOS web site for more details on the FreeRTOS heap
	http://www.freertos.org/a00111.html. */
	for( ;; );
}
/*-----------------------------------------------------------*/

static void prvQueueSendTask( void *pvParameters )
{
TickType_t xNextWakeTime;
//const unsigned long ulValueToSend = 100UL;
struct AppMessage msg;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	/* Initialise xNextWakeTime - this only needs to be done once. */
	xNextWakeTime = xTaskGetTickCount();

	for( ;; )
	{
		/* Place this task in the blocked state until it is time to run again. */
		vTaskDelayUntil( &xNextWakeTime, mainQUEUE_SEND_FREQUENCY_MS );

		/* Send to the queue - causing the queue receive task to unblock and
		toggle the LED.  0 is used as the block time so the sending operation
		will not block - it shouldn't need to block as the queue should always
		be empty at this point in the code. */
		msg.msgID = eTimer;
		msg.pvData = (void *)xNextWakeTime; /* nb: store 16-bit value, not pointer */
		xQueueSend( xQueue, &msg, 0U );

        if(msg.msgByte++ >= 30)
        {
            msg.msgByte = 0;
		    //Enable and Start the conversion
            //in Sequence-of-Channel, Single Conversion Mode
            ADC10_B_startConversion(ADC10_B_BASE, ADC10_B_SEQOFCHANNELS);
        }

	}
}
/*-----------------------------------------------------------*/

static void prvQueueReceiveTask( void *pvParameters )
{
    struct AppMessage msg;
//const unsigned long ulExpectedValue = 100UL;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	for( ;; )
	{
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		xQueueReceive( xQueue, &msg, portMAX_DELAY );

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */
        if( msg.msgID == eTimer )
        {
            vParTestToggleLED( mainTASK_LED );
            ADCtime = (uint16_t)msg.pvData;
        }

        if( msg.msgID == eADC )
        {
            /* Store the data */
            ADCdata[(msg.msgByte+1) & 0xF] = (uint16_t)msg.pvData;
            /* If it's the last channel, transmit the data */
            if(msg.msgByte == 15)
            {
                /* transmit ADCtime, followed by ADCdata */
                msg.msgID++;

            }
        }

		if (mcp2515_irq & MCP2515_IRQ_FLAGGED) {
            int i;
            irq = can_irq_handler();
            if (irq & MCP2515_IRQ_RX && !(irq & MCP2515_IRQ_ERROR)) {
                i = can_recv(&rid, &mext, buf);
                if (i > 0) {
                    if (mext) {
                        /* TODO: replace the following with CSP CAN packet handling when we have room */
                        /* decode the CSP packet */
                        uint32_t src, dest;
                        uint16_t pri, sp, dp;

                        src  = (rid & 0x1F000000) >> 24;
                        dest = (rid & 0x00F80000) >> 19;
                        pri  = (buf[0] & 0xc0) >> 6;
                        dp   = (buf[1] & 0xf) << 2 | (buf[2] & 0xc0) >> 6;
                        sp   = (buf[2] & 0x3f);

                        if ((i == 6) && (dest == CSP_ID) && (dp == 1)) {

                            /* ping request - send response (note this only responds to a ping of payload size zero) */
                            buf[0] = pri << 6 | dest << 1 | (src & 0x10) >> 4;
                            buf[1] = (src & 0xf) << 4 | sp >> 2;
                            buf[2] = (sp & 0x3) << 6 | dp;

                            can_send(((dest<<24) |(src<<19)), 1, buf, i, 3);
                        }
                    }
                }
            } else if (irq & MCP2515_IRQ_ERROR) {
                can_r_reg(MCP2515_CANINTF, &mext, 1);
                can_r_reg(MCP2515_EFLG, &mext, 1);
                // TODO  -assert?

                /*
                while(1) {
                    P1OUT |= BIT0;
                    __delay_cycles(1600000);
                    P1OUT &= ~BIT0;
                    __delay_cycles(1600000);
                }
                */
            }
        }

        if ( !(mcp2515_irq & MCP2515_IRQ_FLAGGED) ) {
            //P1OUT ^= BIT0;
            // TODO: LPM3;
        }
	}
}
/*-----------------------------------------------------------*/

uint8_t ADC10_B_getConvertedChannel (uint16_t baseAddress)
{
    return ( HWREG8(baseAddress + OFS_ADC10MCTL0) & 0x0F );
}


/**********************************************************************//**
 * @brief  ADC10 ISR
 *
 * @param  none
 *
 * @return none
 *************************************************************************/
#pragma vector=ADC10_VECTOR
__interrupt void ADC10_ISR(void)
{

  switch(__even_in_range(ADC10IV,ADC10IV_ADC10IFG))
  {
    case ADC10IV_NONE: break;               // No interrupt
    case ADC10IV_ADC10OVIFG: break;         // conversion result overflow
    case ADC10IV_ADC10TOVIFG: break;        // conversion time overflow
    case ADC10IV_ADC10HIIFG: break;         // ADC10HI
    case ADC10IV_ADC10LOIFG: break;         // ADC10LO
    case ADC10IV_ADC10INIFG: break;         // ADC10IN
    case ADC10IV_ADC10IFG:
        ADCResult.msgID = eADC;
        ADCResult.msgByte = ADC10_B_getConvertedChannel (ADC10_B_BASE);
        ADCResult.pvData = (void *)ADC10_B_getResults(ADC10_B_BASE);
        // now post result to xQueue
        xQueueSendFromISR( xQueue, &ADCResult, 0U );

        __bic_SR_register_on_exit(CPUOFF);  //required?
        break;                          // Clear CPUOFF bit from 0(SR)
    default: break;
  }
}


// ISR for PORT2
#pragma vector=PORT2_VECTOR
__interrupt void P2_ISR(void)
{
    if (P2IFG & CAN_IRQ_PORTBIT) {
        P2IFG &= ~CAN_IRQ_PORTBIT;
        mcp2515_irq |= MCP2515_IRQ_FLAGGED;

        xQueueSendFromISR( xQueue, &CANflag, 0U );
        //__bic_SR_register_on_exit(LPM3_bits);
        __bic_SR_register_on_exit(CPUOFF);
    }
}


#if 0
#include <msp430.h>
#include "mcp2515.h"

uint32_t rid;
uint8_t mext;
uint8_t irq, buf[8], buf2[16];
volatile int i;
#define SLEEP_COUNTER 20

int main()
{
    WDTCTL = WDTPW | WDTHOLD;
    DCOCTL = CALDCO_16MHZ;
    BCSCTL1 = CALBC1_16MHZ;
    BCSCTL2 = DIVS_1;
    BCSCTL3 = LFXT1S_2;
    while (BCSCTL3 & LFXT1OF)
        ;

    P1DIR |= BIT0;
    P1OUT &= ~BIT0;

    can_init();
    if (can_speed(500000, 1, 1) < 0) {
        P1OUT |= BIT0;
        LPM4;
    }

    can_rx_setmask(0, 0xFFFFFF4F, 1);
    can_rx_setfilter(0, 0, 0x00000040);
    can_rx_setfilter(0, 1, 0x0000000F);

    can_rx_setmask(1, 0xFFFFFF0F, 1);
    can_rx_setfilter(1, 0, 0x00000000);
    can_rx_setfilter(1, 1, 0x00000000);
    can_rx_setfilter(1, 2, 0x00000000);
    can_rx_setfilter(1, 3, 0x00000000);

    can_rx_mode(0, MCP2515_RXB0CTRL_MODE_RECV_STD_OR_EXT);

    can_ioctl(MCP2515_OPTION_LOOPBACK, 0);
    can_ioctl(MCP2515_OPTION_ONESHOT, 1);

    for (i=0; i < 16; i++)
        can_r_reg(i * 16, buf2, 16);

    while(1) {
        if (mcp2515_irq & MCP2515_IRQ_FLAGGED) {
            irq = can_irq_handler();
            if (irq & MCP2515_IRQ_RX && !(irq & MCP2515_IRQ_ERROR)) {
                i = can_recv(&rid, &mext, buf);
                if (i > 0) {
                    if (mext && rid == 0x00000080) {
                        can_send(0x00000040, 1, buf, 2, 3);
                    }
                }
            } else if (irq & MCP2515_IRQ_ERROR) {
                can_r_reg(MCP2515_CANINTF, &mext, 1);
                can_r_reg(MCP2515_EFLG, &mext, 1);
                while(1) {
                    P1OUT |= BIT0;
                    __delay_cycles(1600000);
                    P1OUT &= ~BIT0;
                    __delay_cycles(1600000);
                }
            }
        }

        if ( !(mcp2515_irq & MCP2515_IRQ_FLAGGED) ) {
            //P1OUT ^= BIT0;
            LPM3;
        }
    }
    return 0;
}

// ISR for PORT1
#pragma vector=PORT1_VECTOR
__interrupt void P1_ISR(void)
{
    if (P1IFG & CAN_IRQ_PORTBIT) {
        P1IFG &= ~CAN_IRQ_PORTBIT;
        mcp2515_irq |= MCP2515_IRQ_FLAGGED;
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

#endif

